<template>
  <div class="theory-contaienr">
      <pre>
        1.敏捷开发
        是一种以用户需求进化为核心、迭代、循序渐进的开发方法。首先把 用户（客户 ）最关注的软件原型做出来，交付或上线，在实际场景中去快速修改弥补需求中的不足，再次发布版本。
        通过一些敏捷实践方式，细化story ，提供更小的迭代。如此循环，直到用户（客户）满意。适用于需求不明确、创新性或者需要抢占市场的项目。
        敏捷开发最大的特点是迭代式开发，各个阶段都具备独立运行和独立交付的特性。主要是以客户的需求进化为核心，采用迭代、循序渐进的方法进行软件开发。
        在敏捷开发中，软件项目在构建初期被切分成多个子项目，即就是多个sprint，每个sprint中又会有划分成多个build，在一个软件项目完成后会对整个产品从头到尾进行回归验证，
        以确保软件在每一次迭代过程中没有错误产生。在软件最后的发布阶段，客户会对最终的产品进行验收工作。上线后对软件进行一直的维护。
        
        Keep 的开发流程是基于 Scrum ，该流程要求在特定的一段时间内，输出确定的需求，在开发中需求尽量不要变更，开发人员快速完成开发。
        当前，Keep 的迭代和发版周期为两周，保持两周一更新，这样能让用户一直对产品保持新鲜感，也使团队的开发更有节奏。 Keep 技术开发的迭代周期和流程如下图所示：
        <img src="../../assets/img/v2-99b5191c0d185e0e094feb2b5b3faf1f_720w.jpg" />
        为了在两周时间内完成高质量产品，我们需要尽最大努力去执行 Scrum 中的每一步，同时在 Scrum 流程上做了一些适合团队的调整和优化。
        1、需求评审与确定产品经理会使用 Keep 的数据平台分析往期功能的数据来确定是否要做调整和改进，以及结合用户反馈系统的反馈来确定是否要添加某一项新功能。
        在产品内部评审和优化之后，产品经理会和各个业务的技术负责人再一起去做需求的评审，确保需求的合理性和重要程度。接下来我们会将需求拆分到各个开发人员，通过估时来确定每一个 Sprint 具体完成的任务。
        另外我们将 Phabricator 中的需求任务和我们的聊天工具 BearyChat 做了关联，之后当需求发生改变的时候，都会自动的发一条变更消息给这个需求群组中的同事，节省了需求变更后的沟通成本。
        2、任务拆分与评估任务拆分是整个流程中重要的一环，在 Scrum 中我们是这样进行任务拆分和评估的。首先在技术组内会花半天时间讨论，将产品 Task 再次拆分为子任务，
        对应的开发 Owner 会提前准备好需求设计方案和评估时间点，然后组内同事对开发 Owner 提出的设计方案进行建议和二次评估，得出拆解完的子任务和对应的估点时间表。
        我们使用 Phabricator 的 Workboard 进行排列和展示，把所有拆解后的 Task 放到 Workboard 的一列中，同时在子 Task 中填写评估的时间和设置 Task 的优先级。
        如下图所示，Workboard 可以非常清晰的划分出每个任务，同时可以清楚的看出 Task 的完成程度。
        在右上角可以看到整个需求被拆成了多少个子 Task，以及需要消耗的开发时间。使用 WorkBoard 让我们的任务划分更加清晰，根据任务状态来跟进目前整体的进度，有助于整体项目的把控。
        3、高效沟通与开发任务拆分和评估完成后，进入开发阶段。在正式迭代开始之前，会确定一名产品同事作为 Scrum Master 来推动整个项目。除此之外，当涉及到需要多个技术团队支持的需求，
        我们会指定一名技术同事来负责沟通和协调。这样既解决了产品同事不了解技术协调技术沟通的难题，也提高了技术同事的沟通能力。在开发过程中，必要的沟通会议是不可或缺的。
        如何减少不必要的会议，提高会议的效率是我们一直努力的方向。目前 Keep 的会议采用 Google Calendar 邀约的方式，被邀请者可以根据自己的时间和会议的重要性来选择要不要参加，
        同时会议的组织者也可以清楚的查看其他人的时间防止安排冲突。此外我们通过一系列消息自动推送服务来减少开发人员之间的沟通成本，
        比如 Server 服务上线、有新的测试包、Bug 状态变更、新的用户反馈等等各种通知都采用 BearyChat 的 Robot (聊天机器人) 来通知，极大降低了沟通成本。
        Keep 技术团队内部还使用了如 Seafile, Google 企业套件、Alfred、ResuceTime 等各种工具来提升团队和个人的开发效率。
        4、质量把控与测试项目质量也是在开发过程中不可忽视的一环。Keep 代码使用 Phabricator 来托管和 Code Review。
        我们设置了主要项目的代码提交前必须做 CodeReview，同时每个项目设置2 - 3位资深的工程师作为Block Reviewer，合入主干必须得到 Block Reviewer 的同意。对于比较重要、大型的 Diff ，
        我们会单独拉会议室邀请多位工程师来共同 Review 以保证代码质量，并要求代码作者在每次提交之前都应该自己过一遍代码，走一遍冒烟测试，确保基本的功能是完整的。
        进入测试阶段前，我们添加了 Show Case 环节。其实 Show Case 就是产品在工程师提交给 QA 之前组织开发人员、设计师、测试人员简单过一遍功能点，
        发现逻辑上比较明显的一些问题交给开发人员再次修改，以及确保整体流程不会被严重的 Bug Block 住。
        团队内部测试完毕后，会使用内部自动化发布工具发给用户升级，在一周内进行内测和灰度两次测试。
        我们使用微信群运营维护了一批忠实的用户粉丝作为内测用户，内部测试覆盖规模大致为 500 人，灰度测试的覆盖规模增加到 2000 人，
        一方面验证内测的 Bug 是否被解决，另一方面避免遗漏概率低于 0.1% 的问题。
        5、迭代总结与复盘最后是整个迭代末期的总结和复盘。我们会组织一场回顾会议拿出这个 Sprint 版本产品、技术功能点进行展示，同时对线上功能进行数据的同步。如下图展示了 Keep 的部分数据：

          (扩展：瀑布式开发和敏捷式开发、Scrum vs Kanban)

        
        
        
        
        二、ping




        <h2>三、软件绿色版和安装版的区别</h2>
        软件的安装版就是从安装文件里释放出来的版本。也就是下载来之后一般是一个安装文件，点了之后，会有选择让我们装在哪个盘，然后它会释放出文件什么的。
        说白了：安装版的软件,就是要安装。
        绿色版一般下来就是一个压缩文件，里边有一个文件夹，文件夹里就包含了这个软件的各种文件。直接把这些文件释放出来，双击那个主程序图标就可以使用了。
        绿色版说白了：就是免安装版。
        把这个文件下载后,直接打开这个文件夹,里面就有一个文件的启动图标,你直接双击就能打开这个程序了,不用你安装到C盘或D盘了,你可以把这个文件夹随意放在任一个盘里,也可以把启动图标在桌面建一个快捷方式也行.
        绿色版怎么来的？
        安装好软件。然后把那个软件的文件所在的文件夹压缩出来，就成了绿色版。

        两者的不同在于。一般安装版的文件，会写入系统注册表，因此在系统里会有该文件的卸载信息。而绿色版的话在系统里就不会有卸载信息。
        安装版有的软件有插件。而绿色版就都不存插件了。
        拿迅雷来举例吧。如果是安装版的迅雷，装好后我们在网页上点右键会显示“使用迅雷下载”。
        而如果直接是下载绿色版的迅雷来用，一开始右键里不会有“使用迅雷下载”的字样，因为绿色版没有像安装版那样有写入插件信息这个步骤，只能是打开迅雷后，在设置里修复一下，才会有。
        具体情况还有很多，因为软件不同情况也不同。大多数软件都支持绿色版，有一些软件因为一定要用到注册表所以绿色版是用不了的。
        安装版有安装要卸载，绿色版的直接删掉就好，不用卸载。

        个人认为绿色版的软件好一点，因为绿色版的不用安装，省时间，且不用写入注册表，减少注册表冗余，直接解压就可以用了。安装版的要占用资源，大小要看软件的体积来决定。同时他们的安全性是没有区别的
      </pre>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>